// 1. Створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
//     function minNumber (a, b, c) {
//         if (a < b && a < c) {
//             console.log(a)
//         } else if (b < a && b < c) {
//             console.log(b)
//         }
//            else {
//                console.log(c)
//         }
//
//             }
//
//  minNumber(1, 2, 3)

// 2- створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
//     function maxNumber (a, b, c) {
//     if(a > b && a > c) {
//         console.log(a)
//     }
//     else if( b > a && b > c) {
//         console.log(b)
//     }
//     else {
//         console.log(c)
//     }
//     }
//     maxNumber(150, 80, 200)

// 3. Cтворити функцію яка повертає найбільше число з масиву
    let array = [100, 400, 600, 800, 300]



// 4. створити функцію яка повертає найменьше число з масиву
// 5. створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// 6. створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// 7. створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// 8. створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// 9. створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// 10. Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
