// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//


//


//      let one = [2,17,13,6,22,31,45,66,100,-18];
// //     let i = 0;
// //     while(i < one.length) {
// //         console.log(one[i]);
// //
// //         i++;
// //     }
// //
// //     let two = [2,17,13,6,22,31,45,66,100,-18];
// //     for(let i = 0; i < two.length;) {
// //         console.log(two[i]);
// //     }
// //
// //     let three = [2,17,13,6,22,31,45,66,100,-18];
// //     let i = 0;
// //     while(i < three.length) {
// //         if(i % 2 === 1)
// //         console.log(three[i]);
// //         i++;
// //     }
// // //
// //         let four = [2,17,13,6,22,31,45,66,100,-18];
// //         for(let i = 0; i < four.length; i++) {
// //             if (i % 2 === 1) {
// //                 console.log(four[i]);
// //
// //             }
// //         }
//
//
// // let five = [2,17,13,6,22,31,45,66,100,-18];
// //     let i = 0;
// //     while(i < five.length){
// //     if(i % 2 === 0) {
// //         console.log(five[i]);
// //     }
// //         i++;
// //     }
// //
// //
//     let six = [2,17,13,6,22,31,45,66,100,-18];
//     for(let i = 0; i < six.length; i++) {
//         if(i % 2 === 0) {
//             console.log(six[i]);
//         }
//     }

    // let seven = [2,17,13,6,22,31,45,66,100,-18];
    // for(let i = 0; i < seven.length; i++) {
    //     if(seven[i] % 3 === 0) {
    //         seven[i]= "Okten";
    //         console.log(seven[i]);
    //     }
    // }
    // console.log(seven)
    // Моя первісна думка була така, щоб в if (seven % 3 === 0), а не (seven[i]... Але воно чомусь не спрацьовувало

    // let eight = [2,17,13,6,22,31,45,66,100,-18];
    // for (let i = eight.length-1; i >= 0; i--) {
    // console.log(eight[i]);
    // }
    //

    // let oneBack= [2,17,13,6,22,31,45,66,100,-18];
    // let i = -1;
    // while(i === oneBack.length-1) {
    //     console.log(oneBack[i]);
    //
    //     i--;
    // }
    //Не зрозуміла, як в зворотньому напрямку воно задається з while. Please, clarify.

    // let twoBack = [2,17,13,6,22,31,45,66,100,-18];
    // for (let i = twoBack.length-1; i >= 0; i--) {
    // console.log(twoBack[i]);
    // }

